In [1]:
%matplotlib notebook

In [2]:
# Import dependencies

import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import os
import time
import json
import csv

In [3]:
# Import CSV file
path = "college_data.csv"
college_data = pd.read_csv(path, encoding='utf-8')
college_data_df = pd.DataFrame(college_data)
college_data_df.head()

,Year,College_names,College_state,In_state_tuition,Out_of_state_tuition,Admissions_rate_overall,Enrollment,Student Size
0,2002,"""Washington State University""","""WA""",4520,12270,0.7708,5100,4406
1,2003,"""Washington State University""","""WA""",5280,13382,0.7798,6037,4590
2,2004,"""Washington State University""","""WA""",5628,14046,0.7529,5368,4728
3,2005,"""Washington State University""","""WA""",5980,14985,0.7389,22177,19078
4,2006,"""Washington State University""","""WA""",6448,16088,0.7706,22444,18995

In [4]:
college_data_df["Year"] = college_data_df["Year"].astype('object')
college_data_df.dtypes

Year                        object
College_names               object
College_state               object
In_state_tuition             int64
Out_of_state_tuition         int64
Admissions_rate_overall    float64
Enrollment                   int64
Student Size                 int64
dtype: object

In [5]:
college_data_df[["College_names","College_state"]] = college_data_df[["College_names","College_state"]].replace(
    '"', '', regex=True)
college_data_df.head()

,Year,College_names,College_state,In_state_tuition,Out_of_state_tuition,Admissions_rate_overall,Enrollment,Student Size
0,2002,Washington State University,WA,4520,12270,0.7708,5100,4406
1,2003,Washington State University,WA,5280,13382,0.7798,6037,4590
2,2004,Washington State University,WA,5628,14046,0.7529,5368,4728
3,2005,Washington State University,WA,5980,14985,0.7389,22177,19078
4,2006,Washington State University,WA,6448,16088,0.7706,22444,18995

In [6]:
college_df_sorted = college_data_df.sort_values(["College_names","Year"],ascending = (True))
college_df_sorted

,Year,College_names,College_state,In_state_tuition,Out_of_state_tuition,Admissions_rate_overall,Enrollment,Student Size
34,2002,Arizona State University-Tempe,AZ,2585,11105,0.8474,40807,35573
35,2003,Arizona State University-Tempe,AZ,3595,12115,0.8840,42330,37336
36,2004,Arizona State University-Tempe,AZ,4064,12919,0.8610,43920,38117
37,2005,Arizona State University-Tempe,AZ,4406,15095,0.9102,45120,39649
38,2006,Arizona State University-Tempe,AZ,4688,15847,0.9242,47631,38984
...,...,...,...,...,...,...,...,...
12,2014,Washington State University,WA,12428,25510,0.8208,25967,23585
13,2015,Washington State University,WA,11967,25567,0.7964,26752,24100
14,2016,Washington State University,WA,11041,25673,0.7204,27313,24362
15,2017,Washington State University,WA,11391,25817,0.7306,27917,24797
16,2018,Washington State University,WA,11584,25820,0.7719,28198,25675

In [7]:

college_df_sorted = college_df_sorted.rename(columns={'Student Size': 'Student_size'})


college_df_sorted['%_In_state_chng'] =college_df_sorted.groupby('College_names').In_state_tuition.pct_change()
college_df_sorted['%_Out_of_state_chng'] =college_df_sorted.groupby('College_names').Out_of_state_tuition.pct_change()
college_df_sorted['%_admissions_rate_chng'] =college_df_sorted.groupby('College_names').Admissions_rate_overall.pct_change()
college_df_sorted['%_Student_size_chng'] =college_df_sorted.groupby('College_names').Student_size.pct_change()

college_df_sorted.head()

,Year,College_names,College_state,In_state_tuition,Out_of_state_tuition,Admissions_rate_overall,Enrollment,Student_size,%_In_state_chng,%_Out_of_state_chng,%_admissions_rate_chng,%_Student_size_chng
34,2002,Arizona State University-Tempe,AZ,2585,11105,0.8474,40807,35573,NaN,NaN,NaN,NaN
35,2003,Arizona State University-Tempe,AZ,3595,12115,0.8840,42330,37336,0.390716,0.090950,0.043191,0.049560
36,2004,Arizona State University-Tempe,AZ,4064,12919,0.8610,43920,38117,0.130459,0.066364,-0.026018,0.020918
37,2005,Arizona State University-Tempe,AZ,4406,15095,0.9102,45120,39649,0.084154,0.168434,0.057143,0.040192
38,2006,Arizona State University-Tempe,AZ,4688,15847,0.9242,47631,38984,0.064004,0.049818,0.015381,-0.016772

In [8]:
# college_df_sorted["Difference in tuition"]=college_df_sorted["Out_of_state_tuition"]-college_df_sorted["In_state_tuition"]

# college_df_sorted["Percent Difference Change"]=college_df_sorted["Difference in tuition"]/college_df_sorted["Out_of_state_tuition"]


# college_df_sorted=college_df_sorted[['Year','College_names','College_state','In_state_tuition',\
#                      'Out_of_state_tuition','Difference in tuition','Percent Difference Change'\
#                     ,'Enrollment','Student Size','Admissions_rate_overall']]

# college_df_sorted = college_df_sorted.rename(columns={'Year':'Year',\
#                                             'College_names':'College_Names',\
#                                             'College_state':'State',\
#                                             'In_state_tuition':'In_State_Tuition',\
#                                             'Out_of_state_tuition':'Out_of_State_Tuition',\
#                                             'Difference in tuition':'Tuition_Difference',\
#                                             'Percent Difference Change': '%_Difference',\
#                                             'Student Size':'Student_Size',\
#                                             'Admissions_rate_overall':"Admission_%"})
# college_df_sorted.head()

In [9]:
# avg_in_state = college_df_sorted.groupby(['College_Names']).mean()['In_State_Tuition'].rename("Avg_In_State_Tuition") 
# # avg_in_state.head(25)
# avg_in_state_year = college_df_sorted.groupby(['Year']).mean()['In_State_Tuition'].rename("Avg_In_State_Tuition_by_Year")
# # avg_in_state_year.head(25)
# avg_out_of_state = college_df_sorted.groupby(['College_Names']).mean()['Out_of_State_Tuition'].rename("Avg_Out_of_State_Tuition") 
# # avg_out_of_state.head(25)
# avg_out_of_state_year = college_df_sorted.groupby(['Year']).mean()['Out_of_State_Tuition'].rename("Avg_Out_of_State_Tuition_by_Year")
# # avg_in_state_year.head(25)

# tuition_avgs_by_school = pd.DataFrame({"Avg_In_State_Tuition":avg_in_state,
#                                         "Avg_Out_of_State_Tuition": avg_out_of_state,})



# tuition_avgs_by_school['Avg_In_State_Tuition'] = tuition_avgs_by_school['Avg_In_State_Tuition'].map('${:,.2f}'.format)
# tuition_avgs_by_school['Avg_Out_of_State_Tuition'] = tuition_avgs_by_school['Avg_Out_of_State_Tuition'].map('${:,.2f}'.format)
# tuition_avgs_by_school

## Start graphing !!!

In [24]:
# In state vs Out of state scatterplot and regressions
tuition_df = college_df_sorted[['Year','College_names','%_In_state_chng','%_Out_of_state_chng']]
tuition_df = tuition_df.set_index('College_names')

tuition_school_group=tuition_df.groupby(['College_names','Year'])
tuition_avg_school = tuition_school_group.mean()

tuition_avg_school.head()

                                     %_In_state_chng  %_Out_of_state_chng
College_names                  Year
Arizona State University-Tempe 2002              NaN                  NaN
                               2003         0.390716             0.090950
                               2004         0.130459             0.066364
                               2005         0.084154             0.168434
                               2006         0.064004             0.049818